app/views/books/_form.html.erb

      <%= form.label :author_id, "Author" %>
      <%= form.collection_select :author_id, Author.all, :id, :name, prompt: "Select an author", class: "form-control" %>
---
SELECT "authors".* FROM "authors"