app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "s"], ["bio", nil], ["created_at", "2025-02-26 12:31:10.646126"], ["updated_at", "2025-02-26 12:31:10.646126"]]

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "john"], ["updated_at", "2025-02-22 11:58:07.696293"], ["id", 1]]