app/controllers/books_controller.rb

UPDATE "books" SET "description" = ?, "isbn" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "Written 10 boksvxcx"], ["isbn", "1603232"], ["updated_at", "2025-02-27 14:11:57.708425"], ["id", 3]]
---
    def update
        respond_to do |format|
            if @book.update(book_params)

INSERT INTO "books" ("title", "author_id", "description", "isbn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Horse "], ["author_id", nil], ["description", "Horses info"], ["isbn", "3212"], ["created_at", "2025-02-22 12:09:51.562058"], ["updated_at", "2025-02-22 12:09:51.562058"]]
---
    def create
      @book = Book.new(book_params)
      respond_to do |format|
        if @book.save