app/controllers/reviews_controller.rb

    def create
      @review = @book.reviews.build(review_params)  # No user_id needed

      if @review.save
---
INSERT INTO "reviews" ("user_id", "book_id", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", nil], ["book_id", 4], ["rating", 2], ["comment", "sda"], ["created_at", "2025-02-26 13:28:20.197185"], ["updated_at", "2025-02-26 13:28:20.197185"]]

    def set_book
      @book = Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]